In [578]:
import pandas as pd
import numpy as np

In [579]:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [580]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [581]:
# 1. Some values in the the FlightNumber column are missing. 
# These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be 
# put in place. Fill in these missing numbers and make the column an 
# integer column (instead of a float column).

tp = df["FlightNumber"].copy()

In [582]:
tp[1] = 10055
tp[3] = 10075

df["FlightNumber"] = tp.astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [583]:
# 2. The From_To column would be better as two separate columns! 
# Split each string on the underscore delimiter _ to give a new temporary DataFrame  
# with the correct values. Assign the correct column names to this temporary DataFrame.

In [584]:
temp = df["From_To"].str.split("_", expand=True)
temp

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [585]:
temp.rename(columns = {0:"From",1:"To"}, inplace = True)

In [586]:
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [587]:
# 3. Notice how the capitalisation of the city names is all mixed up in this 
# temporary DataFrame. Standardise the strings so that only the first letter is 
# uppercase (e.g. "londON" should become "London".)

In [588]:
temp["From"] = temp["From"].str.capitalize()
temp["To"] = temp["To"].str.capitalize()

In [589]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [590]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [591]:
# 4. Delete the From_To column from df and attach the temporary DataFrame 
# from the previous questions.

In [592]:
df.drop("From_To",inplace= True, axis = 1)

In [593]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [594]:
df = pd.concat([df, temp], axis = 1)

In [595]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [596]:
# 5.In the RecentDelays column, the values have been entered into the DataFrame as a list. 
# We would like each first value in its own column, each
# second value in its own column, and so on. 
# If there isn't an Nth value, the value should be NaN.
# 
# Expand the Series of lists into a DataFrame named delays, 
# rename the columns delay_1, delay_2, etc. and replace the unwanted 
# RecentDelays column in df with delays.

In [597]:
# To make it dynamic, we need the maximum number of columns to be constructed. 
# So we calculate the length of biggest array in RecentDelays

maximumElements = max(df["RecentDelays"].str.len()) 
maximumElements

3

In [601]:
delays = pd.DataFrame() 
for i in range(maximumElements):
    arrayVals = []     
    for val in range(df["RecentDelays"].size):
        try:
            number = df["RecentDelays"].array[val][i]
            arrayVals.append(number)
        except:
            arrayVals.append(np.nan)
    delays["delay_" + str(i+1)] = arrayVals

In [602]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [603]:
df = pd.concat([df, delays], axis = 1)

In [605]:
df.drop("RecentDelays", axis=1, inplace=True)

In [606]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN